> @pdecat I am using provider version 1.11.0 but patching the the role_binding resource still does not seem to work. In my case I added `namespace = "xy"`. Thus I expected Terraform to delete the role binding in the default namespace and add it to the namespace `xy` but it doesn't show any changes in the diff.

That sounds like another issue that I cannot reproduce, e.g. with this change:

```
# git diff
diff --git custom-metrics-stackdriver-adapter.tf custom-metrics-stackdriver-adapter.tf
index a017f19..b0e4ed3 100644
--- custom-metrics-stackdriver-adapter.tf
+++ custom-metrics-stackdriver-adapter.tf
@@ -26,7 +26,7 @@ resource "kubernetes_cluster_role_binding" "custom_metrics_system_auth_delegator
 resource "kubernetes_role_binding" "custom_metrics_auth_reader" {
   metadata {
     name      = "custom-metrics-auth-reader"
-    namespace = "kube-system"
+    namespace = "test"
   }

   subject {
```

I properly get a destruction/recreation:

```
------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_role_binding.custom_metrics_auth_reader must be replaced
-/+ resource "kubernetes_role_binding" "custom_metrics_auth_reader" {
      ~ id = "kube-system/custom-metrics-auth-reader" -> (known after apply)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
            name             = "custom-metrics-auth-reader"
          ~ namespace        = "kube-system" -> "test" # forces replacement
          ~ resource_version = "55078730" -> (known after apply)
          ~ self_link        = "/apis/rbac.authorization.k8s.io/v1/namespaces/kube-system/rolebindings/custom-metrics-auth-reader" -> (known after apply)
          ~ uid              = "3cf9c95f-85dc-1234-1234-42010a880006" -> (known after apply)
        }

        role_ref {
            api_group = "rbac.authorization.k8s.io"
            kind      = "Role"
            name      = "extension-apiserver-authentication-reader"
        }

      ~ subject {
          + api_group = (known after apply)
            kind      = "ServiceAccount"
            name      = "custom-metrics-stackdriver-adapter"
            namespace = "custom-metrics"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------
```